# BoundaryYTranslationSpring Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryYTranslationSpring Property
ParameterTypeId Class See Also
---
"Y Translation - Spring"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryYTranslationSpring { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryYTranslationSpring As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryYTranslationSpring {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace